In [66]:
import pandas as pd

df = pd.DataFrame({
    "names": ["John,Doe","Jane,Don","Jen,Den","Jade,Dow","Jair,Dell"],
    "group": ["PuRpLE","YELLOW","yellow","GREEN","purple"],
    "sex": ["male","female","female","male","male"]
})

In [67]:
df

       names   group     sex
0   John,Doe  PuRpLE    male
1   Jane,Don  YELLOW  female
2    Jen,Den  yellow  female
3   Jade,Dow   GREEN    male
4  Jair,Dell  purple    male

### Lowercase

In [68]:
df['group'].str.lower()

0    purple
1    yellow
2    yellow
3     green
4    purple
Name: group, dtype: object

### Uppercase

In [69]:
df['group'].str.upper()

0    PURPLE
1    YELLOW
2    YELLOW
3     GREEN
4    PURPLE
Name: group, dtype: object

### Capitalize

In [70]:
df['group'].str.capitalize()

0    Purple
1    Yellow
2    Yellow
3     Green
4    Purple
Name: group, dtype: object

In [59]:
df['group'] = df['group'].str.capitalize()

### Find length of string

In [51]:
df['group'].str.len()

0    6
1    6
2    6
3    5
4    6
Name: group, dtype: int64

### Filter based on length of Strings

In [52]:
df[(df['group'].str.len() > 5)]

       names   group     sex
0   John,Doe  PuRpLE    male
1   jane,don  YELLOW  female
2    Jen,den  yellow  female
4  Jair,Dell  purple    male

### Replace

In [71]:
df['sex'] = df["sex"].replace({"male": "M", "female": "F"})
df

       names   group sex
0   John,Doe  PuRpLE   M
1   Jane,Don  YELLOW   F
2    Jen,Den  yellow   F
3   Jade,Dow   GREEN   M
4  Jair,Dell  purple   M

### Split

In [72]:
df['names'].str.split(',')

0     [John, Doe]
1     [Jane, Don]
2      [Jen, Den]
3     [Jade, Dow]
4    [Jair, Dell]
Name: names, dtype: object

### Assign First and Second elements to first_name and last_name

In [73]:
df["first_name"] = df["names"].str.split(",").str.get(0)
df["last_name"] = df["names"].str.split(",").str.get(1)

In [74]:
df

       names   group sex first_name last_name
0   John,Doe  PuRpLE   M       John       Doe
1   Jane,Don  YELLOW   F       Jane       Don
2    Jen,Den  yellow   F        Jen       Den
3   Jade,Dow   GREEN   M       Jade       Dow
4  Jair,Dell  purple   M       Jair      Dell

### Concat

In [75]:
df['first_name'].str.cat(df['group'], sep='-')

0    John-PuRpLE
1    Jane-YELLOW
2     Jen-yellow
3     Jade-GREEN
4    Jair-purple
Name: first_name, dtype: object